<template>
  <div class="block">
    <el-carousel trigger="click" height="400px">
      <el-carousel-item v-for="item in swiperArr" :key="item.title" >
        <h1>{{item.title}}</h1>
        <div class="desc">
          {{item.desc}}
        </div>
      </el-carousel-item>
    </el-carousel>
  </div>
</template>
<script>
export default {
  data(){
    return {
      swiperArr:[
        {bgImg:"http://10.183.34.241/dev-api/profile/upload/2022/07/26/微信图片_20220726135551_20220726142513A027.jpg",title:"教育行业军团1",desc:"实现全天候实时监控、预警、判断捕捞行为、自动锁定并跟踪船只、识别非法捕捞人员的综合性管理平台，解决了依靠人为巡查、半夜无法抓捕捕捞行为船只的实际操作问题。以视频监控、雷达、无人机、车辆数据、人像数据、虚拟身份、公安数据等为支撑，引入智能识别、物联网、云计算、提供大数据存储、查询、分析和关系挖掘等手段，将多维度的感知数据围绕“感、传、管、用”的实战需求融合到一体，实现对人员、车辆、网络、物联轨迹的深度关联与分析，提升渔政巡查人员、警务执法人员等资源整合效率，实现情报制导、精确打击、精准防控。"},
        {bgImg:"http://10.183.34.241/dev-api/profile/upload/2022/07/26/微信图片_20220726135551_20220726142513A027.jpg",title:"教育行业军团2",desc:"实现全天候实时监控、预警、判断捕捞行为、自动锁定并跟踪船只、识别非法捕捞人员的综合性管理平台，解决了依靠人为巡查、半夜无法抓捕捕捞行为船只的实际操作问题。以视频监控、雷达、无人机、车辆数据、人像数据、虚拟身份、公安数据等为支撑，引入智能识别、物联网、云计算、提供大数据存储、查询、分析和关系挖掘等手段，将多维度的感知数据围绕“感、传、管、用”的实战需求融合到一体，实现对人员、车辆、网络、物联轨迹的深度关联与分析，提升渔政巡查人员、警务执法人员等资源整合效率，实现情报制导、精确打击、精准防控。"},
        {bgImg:"http://10.183.34.241/dev-api/profile/upload/2022/07/26/微信图片_20220726135551_20220726142513A027.jpg",title:"教育行业军团3",desc:"实现全天候实时监控、预警、判断捕捞行为、自动锁定并跟踪船只、识别非法捕捞人员的综合性管理平台，解决了依靠人为巡查、半夜无法抓捕捕捞行为船只的实际操作问题。以视频监控、雷达、无人机、车辆数据、人像数据、虚拟身份、公安数据等为支撑，引入智能识别、物联网、云计算、提供大数据存储、查询、分析和关系挖掘等手段，将多维度的感知数据围绕“感、传、管、用”的实战需求融合到一体，实现对人员、车辆、网络、物联轨迹的深度关联与分析，提升渔政巡查人员、警务执法人员等资源整合效率，实现情报制导、精确打击、精准防控。"},
        {bgImg:"http://10.183.34.241/dev-api/profile/upload/2022/07/26/微信图片_20220726135551_20220726142513A027.jpg",title:"教育行业军团4",desc:"实现全天候实时监控、预警、判断捕捞行为、自动锁定并跟踪船只、识别非法捕捞人员的综合性管理平台，解决了依靠人为巡查、半夜无法抓捕捕捞行为船只的实际操作问题。以视频监控、雷达、无人机、车辆数据、人像数据、虚拟身份、公安数据等为支撑，引入智能识别、物联网、云计算、提供大数据存储、查询、分析和关系挖掘等手段，将多维度的感知数据围绕“感、传、管、用”的实战需求融合到一体，实现对人员、车辆、网络、物联轨迹的深度关联与分析，提升渔政巡查人员、警务执法人员等资源整合效率，实现情报制导、精确打击、精准防控。"},
      ]
    }
  }
}
</script>
<style lang="scss" scoped>

.el-carousel__item{
  overflow: hidden;
  color: #fff;
  background-image: url(http://10.183.34.241/dev-api/profile/upload/2022/07/26/微信图片_20220726135551_20220726142513A027.jpg);
  background-size:cover;
  h1{
    margin: 20px;
  }
  .desc{
    margin: 20px;
    width: 50%;
    font-size: 17px;
  }
}

</style>